xfire-sandbox/xfire-ws-security/src/test/org/codehaus/xfire/security/wssecurity/wsse-request-enc.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="1">
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference><ds:X509IssuerSerial xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerName xmlns:ds="http://www.w3.org/2000/09/xmldsig#">CN=alias</ds:X509IssuerName>

<ds:X509SerialNumber xmlns:ds="http://www.w3.org/2000/09/xmldsig#">1137540018</ds:X509SerialNumber>
</ds:X509IssuerSerial></wsse:SecurityTokenReference>
</ds:KeyInfo>
<xenc:CipherData><xenc:CipherValue>F5XJmrV3KyvfNSIQ5kF8mbXGDdHLrv5fsasfoipv6ziHb4yftkn2Dvl8LawI+k1KK/Yk4pd4r3s5
YQX/QQGJUTTYMIWBIjU6iBYeACio24j89EU7XtEDpByO0C8Q85pgEZkx/B6SKRGP7oeeE78LhtNW
+EBanvsDIt61NbboRLY=</xenc:CipherValue></xenc:CipherData>
<xenc:ReferenceList><xenc:DataReference URI="#EncDataId-24658983"/></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security></soap:Header><soap:Body><xenc:EncryptedData Id="EncDataId-24658983" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"/><xenc:CipherData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:CipherValue xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">8Mh/Co86+r6+nCg1G/h2X/0Cg2IHknK/87j7WhmVW1q5U7WCLIJJBOTtvbXT7AdfZx1gQAj38277
NUPQka+dbo4D3OKs+ZZr4Twi2MQ2tetzXUPo0lB4k1CBY7BP2cE1Fco4KulZ8YusDRo9FYXcJblG
DGh2puRXJ8zf6+Vii3ULjE5tT6nz7UtWeUrPZVzcQrZvGBnQLzyM8B5wfqkvVCnXNA5zMsBylrmo
o1Ghu+UcInPphC0Rf3bSOUlHwTuanG4rjDUWSAws+K0mBdAR8YYc0qZ0EfEPeRIaiOT39tf0hA8C
FXZWFyXrJwCLnExZAY6kKJLt8A8scM0ubnFVH8oRdXR3IE2d</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>